import 'package:flutter/material.dart';

class Texts with ChangeNotifier {
  int _chosenLanguage = 0;
  List<String> languages = ['हिंदी', 'বাংলা', 'తెలుగు'];
  // 0: Hindi
  // 1: Bengali
  // 2: Telugu

  int get chosenLanguage => _chosenLanguage;

  final List<String> _hindi = [
    'नमस्ते',
    '1) नीचे दिया हुआ तालिका 00-99 से एक संख्या चुनें। उदाहरण: 05।',
    '2) चयनित संख्या को उल्टा करे। उदाहरण: 50।',
    '3) छोटी संख्या को बड़ी संख्या से घटाए। उदाहरण: 50-05 = 45।',
    '4) संख्या के ऊपर प्रतीक को याद रखना। ',
    '5) \'आगे बढ़ो\' बटन को क्लिक करे।',
    'आगे बढ़ो',
    'जो प्रतिक आपको मिला है \'☼\' येह एकता का प्रतिनिधित्व करता है।',
    'अतीत के बारे में सोचना बंद करो, जो हाथों में है अपने भविष्य के लिए कड़ी मेहनत करो।',
    '-विलियम्स',
    'उपयोगी कड़ियां',
    ' (आईआईटी पाठ के लिए)',
    ' (विज्ञान किट)',
    ' (भारती लिपि)',
    ' (विज्ञान प्रयोग)'
  ];

  final List<String> _bengali = [
    'নমস্কার',
    '1) নিচের তালিকা থেকে 00-99 পর্যন্ত একটি সংখ্যা নির্বাচন করুন। উদাহরণ: 05।',
    '2) নির্বাচিত সংখ্যাটি উল্টান। উদাহরণ: 50।',
    '3) ছোট সংখ্যাটি বড় সংখ্যা থেকে কমান। উদাহরণ: 50-05 = 45।',
    '4) সংখ্যার উপর প্রতীকটি মনে রাখুন। ',
    '5) \'আগে যান\' বাটনটি ক্লিক করুন।',
    'আগে যান',
    'আপনি যে প্রতীকটি পেয়েছেন \'☼\' এটি ঐক্যের প্রতিনিধিত্ব করে।',
    'অতীতের বিষয়ে চিন্তা করা বন্ধ করুন, যা হাতে আছে তা ভবিষ্যতের জন্য কাজ করুন।',
    '-উইলিয়ামস',
    'উপযুক্ত লিংক',
    ' (আইআইটি পাঠ)',
    ' (বিজ্ঞান কিট)',
    ' (ভারতী লিপি)',
    ' (বিজ্ঞান প্রয়োগ)'
  ];

  final List<String> _telugu = [
    'నమస్కారం',
    '1) క్రింది పట్టికల్లో 00-99 వరకు ఒక సంఖ్యను ఎంచుకోండి. ఉదాహరణ: 05.',
    '2) ఎంచుకున్న సంఖ్యను తిప్పండి. ఉదాహరణ: 50.',
    '3) పెద్ద సంఖ్య నుండి చిన్న సంఖ్యను తీసివేయండి. ఉదాహరణ: 50-05 = 45.',
    '4) సంఖ్య పైన ఉన్న చిహ్నాన్ని గుర్తుంచుకోండి.',
    '5) \'కొనసాగండి\' బటన్‌ను క్లిక్ చేయండి.',
    'కొనసాగండి',
    'మీరు పొందిన \'☼\' చిహ్నం ఐక్యతను సూచిస్తుంది.',
    'గతం గురించి ఆలోచించడం మానేయండి, చేతిలో ఉన్న మీ భవిష్యత్తు కోసం కష్టపడండి.',
    '-విలియమ్స్',
    'ఉపయోగకరమైన లింకులు',
    ' (ఐఐటి పాఠాలు)',
    ' (విజ్ఞాన కిట్)',
    ' (భారతి లిపి)',
    ' (విజ్ఞాన ప్రయోగం)'
  ];

  final List<String> _bharati_script_hindi = [];

  List<String> get texts {
    if (_chosenLanguage == 0) {
      return _hindi;
    } else if (_chosenLanguage == 1) {
      return _bengali;
    }
    return _telugu;
  }

  void setLanguage(int language) {
    _chosenLanguage = language;
    notifyListeners();
  }
}
